
## :white_check_mark: Apply Succeeded (cloudflare)

[CI link](https://github.com/nasa9084/infrastructure/actions/runs/13858773576)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
cloudflare relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure/infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure/infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/nasa9084/cloudflare/runs/run-ydTf1GqrUxYgfwgQ

Waiting for the plan to start...

Terraform v1.7.3
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zone.web_apps_tech: Refreshing...
cloudflare_zone.web_apps_tech: Refreshing state... [id=08db5577586403ed45dd2981644cb873]
data.cloudflare_zone.web_apps_tech: Refresh complete after 0s [id=08db5577586403ed45dd2981644cb873]
cloudflare_page_rule.root: Refreshing state... [id=4313b516b3533bffe627036897de17be]
cloudflare_record.mx_web_apps_tech_3: Refreshing state... [id=28a1a3fdd1e0ae98df92f39c9c23e3e5]
cloudflare_record.txt_web_apps_tech: Refreshing state... [id=b640595619d7a86f07bfb4415f821d5e]
cloudflare_record.cname_blog: Refreshing state... [id=5f0b8aebce4aeb0637a18a902c77d31f]
cloudflare_record.cname_resume: Refreshing state... [id=497bdf5dbfd68b6ab1a50392e2d54e26]
cloudflare_record.a_www: Refreshing state... [id=ec038274f96ed2b1cf368027b013af72]
cloudflare_record.mx_web_apps_tech_2: Refreshing state... [id=9837fba3306070023c7bbed9ffd26150]
cloudflare_zone_dnssec.web_apps_tech: Refreshing state... [id=08db5577586403ed45dd2981644cb873]
cloudflare_record.txt_dmarc: Refreshing state... [id=976623b7d808a16e37a8b4e88ff706ee]
cloudflare_record.mx_web_apps_tech_1: Refreshing state... [id=2e8e086b83be57940e62e09ca9ca9f98]
cloudflare_record.txt_github_pages_challenge_blog: Refreshing state... [id=4db83ed5904e1b977a7809b123949c67]
cloudflare_record.a_web_apps_tech: Refreshing state... [id=ebe0222d4aa5a83fe2aa5e459b84b8a1]
cloudflare_page_rule.www: Refreshing state... [id=6e69c393c72e8dd0e16a99f5c4c4d751]
cloudflare_zone_dnssec.web_apps_tech: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_exporter will be created
  + resource "cloudflare_record" "cname_exporter" {
      + allow_overwrite = false
      + content         = "nasa9084.github.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "exporter"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "08db5577586403ed45dd2981644cb873"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

cloudflare_record.cname_exporter: Creating...
cloudflare_record.cname_exporter: Creation complete after 1s [id=fdc0ce876aaa2701a0f97b3284b17cec]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":79,"Program":"tfcmt","SHA1":"c6c63bcdbc990df36851ce9616e98602b31fa267","Target":"cloudflare","Vars":{},"WorkflowName":"Terraform Apply"} -->